[
    {"text": "I am comfortable with the possibility of losing some or all of my initial investment.", "weight": 1},
    {"text": "I prefer stable and consistent returns over the potential for higher returns with more volatility.", "weight": 2},
    {"text": "I am willing to invest in high-risk assets for the possibility of high returns.", "weight": 3},
    {"text": "I enjoy learning about financial markets and investment strategies.", "weight": 3},
    {"text": "I am comfortable with the possibility of losing some or all of my initial investment.", "weight": 1},
    {"text": "I prefer stable and consistent returns over the potential for higher returns with more volatility.", "weight": 2},
    {"text": "I am willing to invest in high-risk assets for the possibility of high returns.", "weight": 3},
    {"text": "I have a long-term investment horizon and can tolerate short-term market fluctuations.", "weight": 2},
    {"text": "I like to closely monitor my investments and make adjustments based on market conditions.", "weight": 1},
    {"text": "I have a good understanding of different investment options and their associated risks.", "weight": 2},
    {"text": "I am willing to invest a significant portion of my portfolio in stocks or equities.", "weight": 3},
    {"text": "I am comfortable with investing in emerging markets or new technologies.", "weight": 2},
    {"text": "I prefer low-risk investments even if they offer lower potential returns.", "weight": 1},
    {"text": "I am willing to accept short-term losses for the potential of long-term gains.", "weight": 3},
    {"text": "I have experienced significant losses in investments before and remained invested.", "weight": 2},
    {"text": "I tend to follow the advice of financial experts or advisors when making investment decisions.", "weight": 1},
    {"text": "I am close to retirement and prioritize preserving my capital over maximizing returns.", "weight": 1},
    {"text": "I enjoy actively trading and speculating in financial markets.", "weight": 3},
    {"text": "I have a low tolerance for market volatility and prefer stable investment options.", "weight": 1},
    {"text": "I aim for steady, predictable returns in my investment portfolio.", "weight": 2},
    {"text": "I am open to investing in alternative assets like real estate or commodities.", "weight": 2},
    {"text": "I often conduct thorough research before making any investment decisions.", "weight": 2},
    {"text": "I consider my investments a long-term commitment and rarely make impulsive changes.", "weight": 3},
    {"text": "I enjoy learning about financial markets and investment strategies.", "weight": 3}
]
